<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>如何用 redis 造一把分布式锁 | wecatch</title>
  <meta name="author" content="wecatch">
  
  <meta name="description" content="wecatch team&#39;s blog">
  
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="如何用 redis 造一把分布式锁"/>
  <meta property="og:site_name" content="wecatch"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/blog/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="wecatch" type="application/atom+xml">
  <link rel="stylesheet" href="/blog/css/style.css" media="screen" type="text/css">
</head>


<body>
<div id="page" class="site">
  <div id="primary" class="content-area">

    <header id="header" class="inner"><div class="site-branding">
  <h1 class="site-title">
    <a href="/blog/">wecatch</a>
  </h1>
  <p class="site-description"></p>
</div>
<nav id="site-navigation" class="main-navigation" role="navigation">
  <ul>
    
      <li><a href="/blog">博客</a></li>
    
      <li><a href="/blog/archives">归档</a></li>
    
      <li><a href="/blog/about">关于</a></li>
    
      <li><a href="/blog/atom.xml">Rss</a></li>
    
      <li><a href="/">官网</a></li>
    
  </ul>
</nav></header>

    <article id="content" class="site-content">
      <main id="main" class="site-main posts-loop" role="main">
        <article class="post article">

  
  
    <h3 class="article-title"><span>如何用 redis 造一把分布式锁</span></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/blog/2016/08/20/distributed-lock-with-redis/" rel="bookmark">
        <time class="entry-date published" datetime="2016-08-20T04:37:42.000Z">
          2016-08-20
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p><a href="http://sanyuesha.com/about/" target="_blank" rel="external">&#x4E09;&#x6708;&#x6C99;</a> <a href="http://sanyuesha.com/2016/08/20/distributed-lock-with-redis/" target="_blank" rel="external">&#x539F;&#x6587;&#x94FE;&#x63A5;</a></p>
<h2 id="&#x57FA;&#x672C;&#x6982;&#x5FF5;"><a href="#&#x57FA;&#x672C;&#x6982;&#x5FF5;" class="headerlink" title="&#x57FA;&#x672C;&#x6982;&#x5FF5;"></a>&#x57FA;&#x672C;&#x6982;&#x5FF5;</h2><p><strong>&#x9501;</strong></p>
<blockquote>
<p><a href="https://en.wikipedia.org/wiki/Lock_(computer_science" target="_blank" rel="external">wiki</a>:In computer science, a lock or mutex (from mutual exclusion) is a synchronization mechanism for enforcing limits on access to a resource in an environment where there are many threads of execution. A lock is designed to enforce a mutual exclusion concurrency control policy.<br>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#xFF0C;&#x9501;&#x6216;&#x4E92;&#x65A5;&#x91CF;&#x662F;&#x4E00;&#x79CD;&#x540C;&#x6B65;&#x673A;&#x5236;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5F3A;&#x884C;&#x9650;&#x5236;&#x5BF9;&#x8D44;&#x6E90;&#x8BBF;&#x95EE;&#x3002;&#x9501;&#x5E38;&#x88AB;&#x7528;&#x4E8E;&#x540C;&#x6B65;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x3002;</p>
</blockquote>
<p>&#x7B80;&#x5355;&#x6765;&#x8BB2;&#xFF0C;&#x9501;&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x591A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x5F53;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x53EA;&#x5141;&#x8BB8;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x5F53;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x8981;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x68C0;&#x67E5;&#x8BE5;&#x8BE5;&#x8D44;&#x6E90;&#x4E0A;&#x662F;&#x5426;&#x5B58;&#x5728;<code>&#x5199;&#x64CD;&#x4F5C;&#x9501;</code>&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x7B49;&#x5F85;&#x9501;&#x7684;&#x91CA;&#x653E;&#x5E76;&#x83B7;&#x5F97;&#x9501;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x5BF9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x3002;</p>
<p><strong>&#x60B2;&#x89C2;&#x9501;</strong></p>
<p>&#x60B2;&#x89C2;&#x9501;&#x5047;&#x8BBE;&#x5728;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x4E8B;&#x52A1;&#x53D1;&#x751F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x603B;&#x662F;&#x4F1A;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4F1A;&#x66F4;&#x6539;&#x6240;&#x64CD;&#x4F5C;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x56E0;&#x6B64;&#x7EBF;&#x7A0B;&#x603B;&#x662F;&#x5BF9;&#x8D44;&#x6E90;&#x52A0;&#x9501;&#x4E4B;&#x540E;&#x624D;&#x4F1A;&#x5BF9;&#x5176;&#x505A;&#x66F4;&#x6539;&#x3002;</p>
<p><strong>&#x4E50;&#x89C2;&#x9501;</strong></p>
<p>&#x4E50;&#x89C2;&#x9501;&#x5047;&#x8BBE;&#x5728;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x4E8B;&#x52A1;&#x53D1;&#x751F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4F1A;&#x66F4;&#x6539;&#x8D44;&#x6E90;&#xFF0C;&#x4E00;&#x65E6;&#x53D1;&#x73B0;&#x8D44;&#x6E90;&#x88AB;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x505C;&#x6B62;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x3002;</p>
<p><strong>&#x5206;&#x5E03;&#x5F0F;&#x9501;</strong></p>
<p>&#x5E38;&#x89C1;&#x7684;&#x9501;&#x6709;&#x591A;&#x7EBF;&#x7A0B;&#x9501;&#x3001;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x884C;&#x7EA7;&#x9501;&#x3001;&#x8868;&#x7EA7;&#x9501;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x9501;&#x7684;&#x7279;&#x70B9;&#x90FD;&#x662F;&#x53D1;&#x751F;&#x5728;&#x5355;&#x4E00;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8FDB;&#x7A0B;&#x3001;&#x4E0D;&#x540C;&#x673A;&#x5668;&#x548C;&#x7CFB;&#x7EDF;&#x7B49;&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x63A7;&#x5236;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x628A;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#x9650;&#x5236;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4E00;&#x628A;&#x5206;&#x5E03;&#x5F0F;&#x9501;"><a href="#&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4E00;&#x628A;&#x5206;&#x5E03;&#x5F0F;&#x9501;" class="headerlink" title="&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4E00;&#x628A;&#x5206;&#x5E03;&#x5F0F;&#x9501;"></a>&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4E00;&#x628A;&#x5206;&#x5E03;&#x5F0F;&#x9501;</h2><p>&#x6211;&#x4EEC;&#x7528; redis &#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x628A;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x9501;&#xFF0C;redis &#x901F;&#x5EA6;&#x5FEB;&#x3001;&#x652F;&#x6301;&#x4E8B;&#x52A1;&#x3001;&#x53EF;&#x6301;&#x4E45;&#x5316;&#x7684;&#x7279;&#x70B9;&#x975E;&#x5E38;&#x9002;&#x5408;&#x521B;&#x5EFA;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x3002;</p>
<a id="more"></a>
<h3 id="&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x5982;&#x4F55;&#x6D88;&#x9664;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5BF9;&#x9501;&#x83B7;&#x53D6;&#x7684;&#x5F71;&#x54CD;"><a href="#&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x5982;&#x4F55;&#x6D88;&#x9664;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5BF9;&#x9501;&#x83B7;&#x53D6;&#x7684;&#x5F71;&#x54CD;" class="headerlink" title="&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x5982;&#x4F55;&#x6D88;&#x9664;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5BF9;&#x9501;&#x83B7;&#x53D6;&#x7684;&#x5F71;&#x54CD;"></a>&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x5982;&#x4F55;&#x6D88;&#x9664;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5BF9;&#x9501;&#x83B7;&#x53D6;&#x7684;&#x5F71;&#x54CD;</h3><p>&#x9501;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x5B58;&#x4E8E; redis &#x4E2D;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684; key&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;redis &#x7528; <code>set</code> &#x547D;&#x4EE4;&#x6765;&#x5B8C;&#x6210;&#x4E00;&#x4E2A; key &#x7684;&#x8BBE;&#x7F6E;(&#x52A0;&#x9501;)&#xFF0C;&#x4F7F;&#x7528; <code>get</code> &#x547D;&#x4EE4;&#x83B7;&#x53D6; key &#x7684;&#x4FE1;&#x606F;(&#x68C0;&#x67E5;&#x9501;)&#x3002;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528; <code>set</code> &#x548C; <code>get</code> &#x547D;&#x4EE4;&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x5982;&#x4E0B;&#x95EE;&#x9898;&#xFF1A;</p>
<p>&#x7EBF;&#x7A0B; A &#x68C0;&#x67E5;&#x9501;&#x662F;&#x5426;&#x5B58;&#x5728;(get)&#x2013;&gt;&#x5426;&#x2013;&gt;&#x52A0;&#x9501;(set)&#xFF0C;&#x5728; A &#x53D1;&#x8D77;&#x52A0;&#x9501;&#x547D;&#x4EE4;&#x4F46;&#x662F;&#x8FD8;&#x6CA1;&#x6709;&#x52A0;&#x9501;&#x6210;&#x529F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x7EBF;&#x7A0B; B &#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86; <code>set</code> &#x64CD;&#x4F5C;&#xFF0C;&#x9501;&#x88AB; B &#x83B7;&#x5F97;&#xFF0C;&#x4F46;&#x662F; A &#x4E5F;&#x53D1;&#x8D77;&#x4E86;&#x52A0;&#x9501;&#x8BF7;&#x6C42;&#xFF0C;&#x7531;&#x4E8E; <code>set</code> &#x547D;&#x4EE4;&#x5E76;&#x4E0D;&#x68C0;&#x67E5; key &#x7684;&#x5B58;&#x5728;&#xFF0C;B &#x7684;&#x9501;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x88AB; A &#x7684; <code>set</code> &#x64CD;&#x4F5C;&#x7834;&#x574F;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;redis &#x63D0;&#x4F9B;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x547D;&#x4EE4; <code>setx</code> : &#x5F53;&#x6307;&#x5B9A;&#x7684; key &#x4E0D;&#x5B58;&#x5728;&#x65F6;&#xFF0C;&#x8BBE;&#x7F6E; key &#x7684;&#x503C;&#x4E3A;&#x6307;&#x5B9A; value&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF0C;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE; 1&#xFF0C;&#x5931;&#x8D25;&#x5219;&#x8FD4;&#x56DE; 0&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x8981;&#x547D;&#x4EE4;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#xFF0C;&#x7EBF;&#x7A0B;&#x5C31;&#x80FD;&#x6B63;&#x786E;&#x83B7;&#x5F97;&#x9501;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x505A;&#x7C7B;&#x4F3C; <code>get</code> &#x68C0;&#x67E5;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4F7F;&#x7528; <code>setx</code> &#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5BF9;&#x9501;&#x8BBE;&#x7F6E;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<h3 id="&#x52A0;&#x9501;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x751F;-crash-&#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x91CA;&#x653E;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;"><a href="#&#x52A0;&#x9501;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x751F;-crash-&#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x91CA;&#x653E;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;" class="headerlink" title="&#x52A0;&#x9501;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x751F; crash &#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x91CA;&#x653E;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;"></a>&#x52A0;&#x9501;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x751F; crash &#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x91CA;&#x653E;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;</h3><p>&#x52A0;&#x9501;&#x6210;&#x529F;&#x5E76;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x52A0;&#x9501;&#x7EBF;&#x7A0B;&#x5BF9;&#x9501;&#x8FDB;&#x884C;&#x91CA;&#x653E;&#xFF0C;&#x4EE5;&#x8BA9;&#x51FA;&#x8D44;&#x6E90;&#x7684;&#x63A7;&#x5236;&#x6743;&#x3002;&#x91CA;&#x653E;&#x9501;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x5220;&#x9664; redis &#x4E2D;&#x8FD9;&#x4E2A;&#x552F;&#x4E00;&#x7684; key&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x4FDD;&#x8BC1;&#x5220;&#x9664;&#x7684;&#x8FD9;&#x4E2A; key &#x662F;&#x8BE5;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x56E0;&#x800C;&#x9501;&#x521B;&#x5EFA;&#x65F6;&#x5FC5;&#x987B;&#x643A;&#x5E26;&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x7684;&#x552F;&#x4E00;&#x7279;&#x5F81;&#x4EE5;&#x6807;&#x793A;&#x521B;&#x5EFA;&#x8005;&#x7684;&#x8EAB;&#x4EFD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x52A0;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x51FA;&#x73B0;&#x5F02;&#x5E38; crash &#x4E86;&#x800C;&#x4E0D;&#x80FD;&#x53CA;&#x65F6;&#x5220;&#x9664;&#x9501;&#xFF0C;&#x5219;&#x4F1A;&#x5BFC;&#x81F4;&#x9501;&#x4E00;&#x76F4;&#x65E0;&#x6CD5;&#x88AB;&#x6B63;&#x786E;&#x91CA;&#x653E;&#xFF0C;&#x8D44;&#x6E90;&#x5904;&#x4E8E;&#x4E00;&#x76F4;&#x88AB;&#x5360;&#x6709;&#xFF0C;&#x522B;&#x7684;&#x7EBF;&#x7A0B;&#x5904;&#x4E8E;&#x4E00;&#x76F4;&#x7B49;&#x5F85;&#x7684;&#x72B6;&#x6001;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#xFF0C;&#x9501;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x5F02;&#x5E38;&#x53D1;&#x751F;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x91CA;&#x653E;&#xFF0C;&#x4EE5;&#x8BA9;&#x51FA;&#x8D44;&#x6E90;&#x7684;&#x63A7;&#x5236;&#x6743;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; redis &#x7684;&#x8D85;&#x65F6;&#x673A;&#x5236;&#x6765;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#x3002;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x89C6;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x800C;&#x5B9A;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x6700;&#x5927;&#x5141;&#x8BB8;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x52A0;&#x9501;&#x6210;&#x529F;&#x4E4B;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x5BF9; key &#x8BBE;&#x7F6E; TTL&#xFF0C;&#x5426;&#x5219;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4; key &#x88AB;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0D;&#x65AD;&#x8BBE;&#x7F6E; TTL &#x800C;&#x65E0;&#x6CD5;&#x8FC7;&#x671F;&#x3002;</p>
<figure class="highlight python"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">if</span> CONN.setnx(lockname, identifier):</span><br><span class="line">  CONN.expire(lockname, timeout)</span><br></pre></td></tr></table></figure>
<h3 id="&#x52A0;&#x9501;&#x4E4B;&#x540E;&#x5982;&#x4F55;&#x6709;&#x6548;&#x76D1;&#x6D4B;&#x9501;&#x662F;&#x5426;&#x88AB;&#x7BE1;&#x6539;&#xFF1F;"><a href="#&#x52A0;&#x9501;&#x4E4B;&#x540E;&#x5982;&#x4F55;&#x6709;&#x6548;&#x76D1;&#x6D4B;&#x9501;&#x662F;&#x5426;&#x88AB;&#x7BE1;&#x6539;&#xFF1F;" class="headerlink" title="&#x52A0;&#x9501;&#x4E4B;&#x540E;&#x5982;&#x4F55;&#x6709;&#x6548;&#x76D1;&#x6D4B;&#x9501;&#x662F;&#x5426;&#x88AB;&#x7BE1;&#x6539;&#xFF1F;"></a>&#x52A0;&#x9501;&#x4E4B;&#x540E;&#x5982;&#x4F55;&#x6709;&#x6548;&#x76D1;&#x6D4B;&#x9501;&#x662F;&#x5426;&#x88AB;&#x7BE1;&#x6539;&#xFF1F;</h3><p>redis &#x63D0;&#x4F9B;&#x4E86; pipeline &#x548C;&#x4E8B;&#x52A1;&#x64CD;&#x4F5C;&#x6765;&#x4FDD;&#x8BC1;&#x591A;&#x4E2A;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5185;&#x5168;&#x90E8;&#x5B8C;&#x6210;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x591A;&#x6B21;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x5E26;&#x6765;&#x7684;&#x5F00;&#x9500;&#xFF0C;watch  &#x547D;&#x4EE4;&#x53C8;&#x53EF;&#x4EE5;&#x5728;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x5BF9;&#x6240;&#x8981;&#x64CD;&#x4F5C;&#x7684; key &#x6267;&#x884C;&#x76D1;&#x6D4B;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x4E86;&#x4E8B;&#x52A1;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x9501;&#x7BE1;&#x6539;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x52A0;&#x9501;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x5BF9;&#x9501;&#x8FDB;&#x884C; watch &#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x65E6;&#x9501;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5219;&#x7EC8;&#x6B62;&#x4E8B;&#x52A1;&#xFF0C;&#x56DE;&#x6EDA;&#x64CD;&#x4F5C;&#x3002;</p>
<figure class="highlight python"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">pipe = CONN.pipeline(<span class="keyword">True</span>)</span><br><span class="line">pipe.watch(lock)</span><br></pre></td></tr></table></figure>
<h3 id="&#x63D0;&#x4F9B;&#x9501;&#x7684;&#x5BBF;&#x4E3B;&#x673A;-redis-&#x670D;&#x52A1;&#x5668;-crash-&#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x5EFA;&#x7ACB;&#x548C;&#x91CA;&#x653E;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;"><a href="#&#x63D0;&#x4F9B;&#x9501;&#x7684;&#x5BBF;&#x4E3B;&#x673A;-redis-&#x670D;&#x52A1;&#x5668;-crash-&#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x5EFA;&#x7ACB;&#x548C;&#x91CA;&#x653E;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;" class="headerlink" title="&#x63D0;&#x4F9B;&#x9501;&#x7684;&#x5BBF;&#x4E3B;&#x673A;( redis &#x670D;&#x52A1;&#x5668;) crash &#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x5EFA;&#x7ACB;&#x548C;&#x91CA;&#x653E;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;**"></a>&#x63D0;&#x4F9B;&#x9501;&#x7684;&#x5BBF;&#x4E3B;&#x673A;( redis &#x670D;&#x52A1;&#x5668;) crash &#x5BFC;&#x81F4;&#x9501;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x5EFA;&#x7ACB;&#x548C;&#x91CA;&#x653E;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;**</h3><p>&#x4E0D;&#x8BBA;&#x662F;&#x901A;&#x4FE1;&#x6545;&#x969C;&#x6216;&#x662F;&#x670D;&#x52A1;&#x5668;&#x6545;&#x969C;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x9501;&#x670D;&#x52A1;&#x5668;&#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#xFF0C;&#x6B64;&#x65F6;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x5BA2;&#x6237;&#x7AEF;&#x52A0;&#x9501;&#x548C;&#x91CA;&#x653E;&#x9501;&#x7684;&#x8BF7;&#x6C42;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x5E94;&#x6025;&#x5904;&#x7406;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x7A0B;&#x5E8F;&#x6D41;&#x7A0B;&#x7684;&#x5B8C;&#x6574;&#x4F53;&#x9A8C;&#xFF0C;&#x52A0;&#x5F3A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5065;&#x58EE;&#x6027;&#x3002;&#x6BD4;&#x5982;&#x76F8;&#x5E94;&#x7684;&#x8D85;&#x65F6;&#x63D0;&#x793A;&#xFF0C;&#x5F02;&#x5E38;&#x544A;&#x8B66;&#x7B49;&#x3002;</p>
<h2 id="&#x54EA;&#x4E9B;&#x8FB9;&#x754C;&#x9700;&#x8981;&#x6CE8;&#x610F;"><a href="#&#x54EA;&#x4E9B;&#x8FB9;&#x754C;&#x9700;&#x8981;&#x6CE8;&#x610F;" class="headerlink" title="&#x54EA;&#x4E9B;&#x8FB9;&#x754C;&#x9700;&#x8981;&#x6CE8;&#x610F;"></a>&#x54EA;&#x4E9B;&#x8FB9;&#x754C;&#x9700;&#x8981;&#x6CE8;&#x610F;</h2><p>1.&#x53EA;&#x6709;&#x9501;&#x6B63;&#x786E;&#x91CA;&#x653E;&#x624D;&#x7B97;&#x662F;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x5B8C;&#x6574;&#x7ED3;&#x675F;&#xFF0C;&#x5982;&#x679C;&#x9501;&#x91CA;&#x653E;&#x5931;&#x8D25;&#xFF0C;&#x6BD4;&#x5982;&#x88AB;&#x7BE1;&#x6539;&#x3001;&#x9501;&#x670D;&#x52A1;&#x5668;&#x5F02;&#x5E38;&#x7B49;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x53D8;&#x52A8;&#x548C;&#x8C03;&#x6574;&#x3002;</p>
<p>2.&#x8BBE;&#x7F6E; TTL &#x4E00;&#x5B9A;&#x8981;&#x662F;&#x52A0;&#x9501;&#x6210;&#x529F;&#x4E4B;&#x540E;&#xFF0C;&#x5426;&#x5219;&#x6240;&#x6709;&#x83B7;&#x53D6;&#x9501;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x4F1A;&#x5C1D;&#x8BD5; TTL &#x5BFC;&#x81F4;&#x9501;&#x65E0;&#x6CD5;&#x8FC7;&#x671F;&#x3002;</p>
<p>3.&#x9501;&#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x4E5F;&#x5C31;&#x662F;&#x83B7;&#x53D6;&#x9501;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6700;&#x5927;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6839;&#x636E;&#x6267;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x80FD;&#x591F;&#x5BB9;&#x5FCD;&#x7684;&#x6700;&#x957F;&#x65F6;&#x95F4;&#x4E3A;&#x9650;</p>
<h2 id="&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;-python-&#x5B9E;&#x73B0;"><a href="#&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;-python-&#x5B9E;&#x73B0;" class="headerlink" title="&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684; python &#x5B9E;&#x73B0;"></a>&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684; python &#x5B9E;&#x73B0;</h2><script src="//gist.github.com/5e474f42c8167ab32a6627ddd837fc83.js?file=redis_lock.py"></script>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/blog/categories/技术/">技术</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/blog/tags/redis/">redis</a>, <a href="/blog/tags/lock/">lock</a>, <a href="/blog/tags/distributed/">distributed</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>

  
	<section id="comments" class="comment">
	  <div id="disqus_thread">
	  <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
	  </div>
	</section>

	<script type="text/javascript">
	var disqus_shortname = 'wecatch';
	(function(){
	  var dsq = document.createElement('script');
	  dsq.type = 'text/javascript';
	  dsq.async = true;
	  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
	  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	}());
	(function(){
	  var dsq = document.createElement('script');
	  dsq.type = 'text/javascript';
	  dsq.async = true;
	  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
	  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	}());
	</script>





      </main>
    </article>

    <footer id="colophon" class="site-footer" role="contentinfo"><p class="site-info">
  Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
  Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
  </br>
  
  &copy; 2016 wecatch
  
</p>
</footer>
    
<script>
    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
            m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    ga('create', 'UA-79591400-1', 'auto');
    ga('send', 'pageview');

</script>

  </div>
</div>
</body>
</html>