<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>How about a nice cup of React | wecatch</title>
  <meta name="author" content="wecatch">
  
  <meta name="description" content="wecatch team&#39;s blog">
  
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="How about a nice cup of React"/>
  <meta property="og:site_name" content="wecatch"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/blog/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="wecatch" type="application/atom+xml">
  <link rel="stylesheet" href="/blog/css/style.css" media="screen" type="text/css">
</head>


<body>
<div id="page" class="site">
  <div id="primary" class="content-area">

    <header id="header" class="inner"><div class="site-branding">
  <h1 class="site-title">
    <a href="/blog/">wecatch</a>
  </h1>
  <p class="site-description"></p>
</div>
<nav id="site-navigation" class="main-navigation" role="navigation">
  <ul>
    
      <li><a href="/blog">博客</a></li>
    
      <li><a href="/blog/archives">归档</a></li>
    
      <li><a href="/blog/about">关于</a></li>
    
      <li><a href="/blog/atom.xml">Rss</a></li>
    
      <li><a href="/">官网</a></li>
    
  </ul>
</nav></header>

    <article id="content" class="site-content">
      <main id="main" class="site-main posts-loop" role="main">
        <article class="post article">

  
  
    <h3 class="article-title"><span>How about a nice cup of React</span></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/blog/2016/07/05/how-about-a-nice-cup-of-React/" rel="bookmark">
        <time class="entry-date published" datetime="2016-07-04T17:25:41.000Z">
          2016-07-05
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p><a href="http://braavos.me" target="_blank" rel="external">&#x843D;&#x5728;&#x6DF1;&#x6D77;</a> <a href="http://braavos.me/blog/2016/07/05/how-about-a-nice-cup-of-react/" target="_blank" rel="external">&#x539F;&#x6587;&#x94FE;&#x63A5;</a></p>
<p>&#x63A5;&#x89E6; React &#x4E00;&#x5E74;&#x5DE6;&#x53F3;&#xFF0C;&#x671F;&#x95F4;&#x5728;&#x5355;&#x9875;&#x9762;&#x3001;&#x5355;&#x9875;&#x5E94;&#x7528;&#x90FD;&#x6709;&#x4F7F;&#x7528;&#xFF0C; &#x5B83;&#x6781;&#x5927;&#x5730;&#x6539;&#x53D8;&#x4E86;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;&#x3002;&#x4E3A;&#x65B9;&#x4FBF;&#x5FEB;&#x901F;&#x51FA;&#x4EA7;&#x54C1;&#xFF0C;&#x95F2;&#x6687;&#x4E4B;&#x4F59;&#x4E5F;&#x5C1D;&#x8BD5;&#x5199;&#x4E86;&#x70B9;&#x57FA;&#x7840;&#x7EC4;&#x4EF6;: <a href="http://github.com/jerryshew/react-component" target="_blank" rel="external">react-component</a>, <a href="http://github.com/jerryshew/react-image-cropper" target="_blank" rel="external">react-image-cropper</a>&#xFF0C;<a href="http://github.com/jerryshew/react-touch-gallery" target="_blank" rel="external">react-touch-gallery</a>, <a href="http://github.com/jerryshew/react-file-upload" target="_blank" rel="external">react-file-upload</a>&#x3002;&#x4E5F;&#x4E00;&#x76F4;&#x8BA1;&#x5212;&#x7740;&#x5199;&#x70B9;&#x5FC3;&#x5F97;&#x603B;&#x7ED3;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x8FEB;&#x4E8E;&#x5FD9;&#x3001;&#x6D6E;&#x8E81;&#xFF0C;&#x96BE;&#x9759;&#x4E0B;&#x5FC3;&#x5199;&#x4E1C;&#x897F;&#xFF0C;&#x5C61;&#x6B21;&#x4F5C;&#x7F62;&#x3002;&#x8FD9;&#x4E24;&#x5929;&#x521A;&#x79BB;&#x804C;&#xFF0C;&#x51B3;&#x5B9A;&#x628A;&#x8FD9;&#x7BC7;&#x603B;&#x7ED3;&#x8865;&#x4E0A;&#x3002;</p>
<a id="more"></a>
<p>&#x5728; React &#x4E4B;&#x524D;&#xFF0C;&#x73A9;&#x8FC7;&#x4E00;&#x70B9;&#x70B9; Angular &#x8DDF; Backbone&#xFF0C;Backbone &#x662F;&#x6BD4;&#x8F83;&#x8F7B;&#x91CF;&#x7EA7; MVC&#xFF0C;Angular &#x8F83;&#x91CD;&#xFF0C;&#x5B83;&#x7684;&#x6307;&#x4EE4;&#x3001;&#x6CE8;&#x5165;&#x5F0F;&#x5199;&#x6CD5;, &#x8F83;&#x6B7B;&#x677F;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4E0D;&#x591F;&#x7B80;&#x6D01;&#x7684; API&#xFF0C;&#x8BF8;&#x591A;&#x6982;&#x5FF5;&#x7B49;&#x7B49;&#xFF0C;&#x6700;&#x7EC8;&#x53EA;&#x662F;&#x88AB;&#x6211;&#x5F53;&#x73A9;&#x5177;&#x6298;&#x817E;&#x4E86;&#x4E0B;&#x3002;&#x7531;&#x4E8E;&#x63A5;&#x89E6;&#x5230;&#x9879;&#x76EE;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x82B1;&#x5728; view &#x7684;&#x4EA4;&#x4E92;&#x3001;&#x4E8B;&#x4EF6;&#x3001;&#x53D8;&#x5316;&#x66F4;&#x65B0;&#x4E0A;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x719F;&#x6089;&#x7684; jQuery&#xFF0C;&#x539F;&#x56E0;&#x65E0;&#x975E;&#x662F;&#xFF1A;&#x719F;&#x7EC3;&#xFF0C;&#x53EF;&#x63A7;&#xFF0C;&#x6700;&#x8F7B;&#x4F9D;&#x8D56;&#xFF0C;&#x5FEB;&#x901F;&#x7075;&#x6D3B;&#x3002;&#x8FC7;&#x7A0B;&#x57FA;&#x672C;&#x4E0A;&#x662F;: &#x547D;&#x540D; DOM&#xFF0C;&#x7ED9; DOM &#x52A0;&#x7279;&#x6548;&#xFF0C;&#x53D6;&#x6570;&#x636E;&#x66F4;&#x65B0; DOM&#xFF0C; &#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x5230; DOM &#x7B49;&#x7B49;&#x3002;&#x65F6;&#x95F4;&#x4E00;&#x4E45;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x5F88;&#x660E;&#x663E;&#x4E86;&#xFF1A;&#x5373;&#x4F7F;&#x591A;&#x6B21;&#x5C1D;&#x8BD5;&#x505A;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#x7684;&#x62BD;&#x8C61;&#x5206;&#x5C42;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x4E71;&#xFF0C;&#x592A;&#x9891;&#x7E41;&#x4E0E; DOM &#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x9047;&#x5230;&#x95EE;&#x9898;&#x4E0D;&#x597D;&#x6392;&#x67E5;&#xFF0C;&#x7EF4;&#x62A4;&#x4E5F;&#x5F88;&#x75DB;&#x82E6;&#x3002;&#x5982;&#x679C;&#x80FD;&#x5C3D;&#x91CF;&#x5C11;&#x78B0; DOM&#xFF0C;&#x4EE5;&#x6570;&#x636E;&#x3001;&#x903B;&#x8F91;&#x5BFC;&#x5411;&#x6765;&#x5199; view &#x5462;&#xFF1F;</p>
<p>Github &#x4E0A;&#x6709; xx &#x6B65;&#x4ECE; jQuery &#x5230; Backbone, &#x5C31;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x6B65;&#x6B65;&#x8FED;&#x4EE3;&#xFF0C;&#x89E3;&#x91CA; Backbone &#x5982;&#x4F55;&#x62BD;&#x8C61;&#x5206;&#x5C42;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x3001;&#x903B;&#x8F91;&#x3001;&#x4E8B;&#x4EF6;&#x3001;view &#x64CD;&#x4F5C;&#x505A;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x5F97;&#x5C42;&#x7EA7;&#x6E05;&#x6670;&#xFF0C;&#x903B;&#x8F91;&#x5206;&#x660E;&#x3002;&#x53EF;&#x5982;&#x679C;&#x53EA;&#x4E3A;&#x89E3;&#x51B3; view &#x5C42;&#x95EE;&#x9898;&#x7684;&#x8BDD;&#xFF0C;&#x662F;&#x6CA1;&#x5FC5;&#x8981;&#x5F15;&#x5165;&#x8FC7;&#x591A;&#x6982;&#x5FF5;&#x548C;&#x89C4;&#x5219;&#x7684;&#xFF0C;&#x4E14; view &#x672C;&#x8EAB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x9AD8;&#x590D;&#x7528;&#x6027;&#x7B49;&#x4E5F;&#x6CA1;&#x6709;&#x88AB;&#x89E3;&#x51B3;&#x3002;</p>
<p>React &#x5E26;&#x7740;&#x53D8;&#x9769;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x4F7F;&#x547D;&#x800C;&#x6765;&#xFF0C;&#x58F0;&#x79F0;&#x4E13;&#x6CE8; view &#x5C42;&#xFF0C;&#x7279;&#x70B9;&#x662F;&#x7EC4;&#x4EF6;&#x5F0F;&#x5F00;&#x53D1;&#xFF0C;&#x6709;&#x7740;&#x7B80;&#x6D01;&#x5408;&#x7406;&#x7684; API&#xFF0C;&#x4E0D;&#x9519;&#x6027;&#x80FD;&#x7B49;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x7EC4;&#x4EF6;&#x5F0F;&#xFF0C;&#x5927;&#x6982;&#x5305;&#x62EC;&#x4E86;&#x5916;&#x90E8;&#x5C5E;&#x6027;&#x8DDF;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x3002;&#x6BD4;&#x5982;&#x7535;&#x89C6;&#x76D2;&#x5B50;&#xFF0C;&#x5BF9;&#x5C4F;&#x5E55;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x51E0;&#x79CD;&#x63D2;&#x53E3;&#xFF1B;&#x5185;&#x90E8;&#x6784;&#x9020;&#x5BF9;&#x5916;&#x662F;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x6839;&#x636E;&#x63D2;&#x53E3;&#x63A5;&#x5165;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x5448;&#x73B0;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5C4F;&#x5E55;&#x4E5F;&#x65E0;&#x9700;&#x77E5;&#x9053;&#x76D2;&#x5B50;&#x5185;&#x90E8;&#x7684;&#x8FD0;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x7528; jQuery &#x65F6;&#xFF0C;&#x5927;&#x5BB6;&#x4E5F;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x5C01;&#x88C5;&#x8FC7;&#x4E00;&#x4E9B;&#x300E;&#x7EC4;&#x4EF6;&#x300F;&#xFF0C;&#x4F9B;&#x5916;&#x90E8;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x8D2D;&#x7269;&#x8F66; Counter&#xFF0C;&#x81EA;&#x5B9A;&#x4E49;&#x64AD;&#x653E;&#x5668;&#x7B49;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x4F1A;&#x50CF; React &#x90A3;&#x6837;&#x901A;&#x901A;&#x90FD;&#x662F;&#x7EC4;&#x4EF6;&#x3002;&#x5728; React &#x91CC;&#xFF0C;&#x7EC4;&#x4EF6;&#x5305;&#x542B; props(&#x5916;&#x90E8;&#x5C5E;&#x6027;)&#x8DDF; state(&#x5185;&#x90E8;&#x72B6;&#x6001;), &#x5177;&#x4F53;&#x7EC6;&#x8282;&#x53EF;&#x4EE5;&#x53BB;&#x770B; React &#x5B98;&#x7F51;&#x3002;</p>
<p>&#x521D;&#x6B21;&#x5BF9;&#x7EC4;&#x4EF6;&#x5F0F;&#x601D;&#x7EF4;&#x8D5E;&#x53F9;&#x7684;&#x662F;&#x8BC4;&#x8BBA;&#x7684;&#x52A0;&#x8F7D;&#x66F4;&#x591A;&#x529F;&#x80FD;&#x3002;&#x4E00;&#x822C;&#x7528; jQuery &#x7684;&#x8BDD;&#xFF0C;&#x601D;&#x8DEF;&#x662F;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#xFF0C;&#x7EC4;&#x88C5; list DOM &#xFF0C;append &#x4E0A;&#x53BB;; &#x6362;&#x505A;&#x7EC4;&#x4EF6;&#x5F0F;&#x601D;&#x8DEF;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x3002;&#x8BC4;&#x8BBA;&#x7684;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x5C5E;&#x4E8E;&#x8BC4;&#x8BBA;&#x5185;&#x90E8;&#x72B6;&#x6001;&#xFF0C;&#x90A3;&#x4E48;&#x52A0;&#x8F7D;&#x66F4;&#x591A;&#x8C03;&#x6574;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x5C31;&#x597D;&#x4E86;(&#x4E0D;&#x65AD;&#x7EC3;&#x4E60;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x5BFC;&#x5411;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x5408;&#x7406;&#x8BBE;&#x8BA1; props &#x8DDF; state&#xFF0C;&#x5BF9;&#x4E8E;&#x901A;&#x5E38;&#x9879;&#x76EE;&#x9700;&#x6C42;&#xFF0C;&#x5199;&#x8D77;&#x6765;&#x5C31;&#x975E;&#x5E38;&#x5FEB;&#x4E86;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x57FA;&#x672C;&#x907F;&#x5F00;&#x4E86;&#x5BF9; DOM &#x7684;&#x64CD;&#x4F5C;)&#xFF0C;React &#x5E2E;&#x4F60;&#x628A;&#x72B6;&#x6001;&#x7684;&#x66F4;&#x65B0;&#x9AD8;&#x6548;&#x7684;&#x53CD;&#x6620;&#x5230; DOM &#x66F4;&#x65B0;&#x3002;</p>
<p>&#x9010;&#x6E10;&#x5BF9;&#x7EC4;&#x4EF6;&#x5F0F;&#x5F00;&#x53D1;&#x8F7B;&#x8F66;&#x719F;&#x8DEF;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x4E5F;&#x4E0D;&#x65AD;&#x5DE9;&#x56FA;&#x7EC4;&#x4EF6;&#x5316;&#x5F00;&#x53D1;&#x601D;&#x7EF4;&#xFF0C;&#x4E8E;&#x662F;&#x5F00;&#x59CB;&#x771F;&#x6B63;&#x4FE1;&#x670D; React &#x7684; Learn once, write anywhere.</p>
<p>&#x7EC4;&#x4EF6;&#x771F;&#x7684;&#x90A3;&#x4E48;&#x597D;&#x4E48;&#xFF1F;</p>
<p>&#x7EC4;&#x4EF6;&#x5806;&#x53E0;&#x7EC4;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#x8BA9;&#x9AD8;&#x590D;&#x7528;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x8FD8;&#x662F;&#x9047;&#x5230;&#x4E86;&#x4E9B;&#x95EE;&#x9898;&#xFF1A;1. &#x521A;&#x4E0A;&#x624B;&#x5F88;&#x5FEB;&#x5C31;&#x9047;&#x5230;&#x7EC4;&#x4EF6;&#x5982;&#x4F55;&#x901A;&#x4FE1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x770B;&#x4E86; React &#x6587;&#x6863;&#x624D;&#x5F04;&#x660E;&#x767D;&#xFF1B;2. &#x5728;&#x5199; Dropdown &#x65F6;&#xFF0C;&#x6539;&#x53D8;&#x5916;&#x90E8;&#x9ED8;&#x8BA4;&#x9009;&#x4E2D;&#x503C;&#x5E76;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4; Dropdown &#x9009;&#x4E2D;&#x503C;&#x53D8;&#x5316;&#x3002;&#x5F53;&#x65F6;&#x5934;&#x8111;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;&#x6298;&#x817E;&#x4E86;&#x534A;&#x5929;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F52;&#x7EB3;&#x4E3A;&#xFF1A;<strong>state &#x4F9D;&#x8D56;&#x4E8E; props &#x7684;&#x521D;&#x59CB;&#x503C;(&#x8BE5;&#x53D8;&#x5316;&#x540E;&#x4E5F;&#x9700;&#x5411;&#x5185;&#x4F20;&#x9012;), &#x800C; state &#x4E5F;&#x901A;&#x8FC7;&#x81EA;&#x8EAB;&#x5185;&#x90E8;&#x7EF4;&#x62A4;</strong>&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6709;&#x5F88;&#x591A;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x8FD9;&#x91CC;&#x5185;&#x90E8;&#x7EF4;&#x62A4;&#x662F;&#x6307; Dropdown &#x9009;&#x4E2D;&#x6765;&#x6539;&#x53D8; state&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x8BA9; props &#x6539;&#x53D8;&#x518D;&#x6765;&#x89E6;&#x53D1; state &#x5462;&#xFF0C;&#x770B;&#x4E86; React &#x751F;&#x547D;&#x5468;&#x671F;&#x624D;&#x77E5;&#x9053;&#x6709; <code>componentWillReceiveProps</code> &#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x4E0D;&#x5F97;&#x4E0D;&#x8D5E;&#x53F9; React &#x751F;&#x547D;&#x5468;&#x671F;&#x8BBE;&#x8BA1;&#x7684;&#x5468;&#x5168;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5728;&#x540E;&#x6765;&#x7528; Ember.js &#x5199;&#x7EC4;&#x4EF6;&#x65F6;&#x540C;&#x6837;&#x4E5F;&#x9047;&#x5230;&#x4E86;&#xFF0C;&#x53EA;&#x662F;&#x5B9E;&#x73B0;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF1B;3. &#x7EC4;&#x4EF6;&#x5C42;&#x7EA7;&#x6DF1;&#xFF0C;&#x5C42;&#x5C42;&#x4F20;&#x9012; props &#x5230;&#x5B50;&#x7EC4;&#x4EF6;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;React &#x63D0;&#x4F9B;&#x4E86; context&#xFF0C;&#x4F7F;&#x5B50;&#x7EC4;&#x4EF6;&#x65B9;&#x4FBF;&#x7684;&#x83B7;&#x53D6;&#x7236;&#x7EC4;&#x4EF6;&#x94FE;&#x4E0A;&#x4E0B;&#x6587; props&#xFF1B;4. &#x7EC4;&#x4EF6;&#x7684;&#x88AB;&#x52A8;&#x65B9;&#x6CD5;&#x5982;&#x4F55;&#x8C03;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x89E6;&#x53D1;&#x7EC4;&#x4EF6;&#x7684;&#x64CD;&#x4F5C;&#xFF1F;&#x901A;&#x8FC7; refs &#x53EF;&#x4EE5;&#x62FF;&#x5230;&#x7EC4;&#x4EF6;&#x5B9E;&#x4F8B;&#xFF0C;&#x4ECE;&#x800C;&#x8C03;&#x7528;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;&#xFF0C;&#x800C; <code>findDOMNode</code> &#x5219;&#x80FD;&#x62FF;&#x5230; DOM &#x5143;&#x7D20;&#x7B49;&#x7B49;&#x3002;&#x4E0D;&#x65AD;&#x6709;&#x65B0;&#x95EE;&#x9898;&#x6D8C;&#x51FA;&#xFF0C;&#x95EE;&#x9898;&#x4E5F;&#x5728;&#x4E00;&#x4E00;&#x88AB;&#x89E3;&#x51B3;&#xFF0C;React &#x4E4B;&#x8DEF;&#x8FDB;&#x9636;&#x8FD8;&#x5728;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x7EC4;&#x4EF6;&#x6A21;&#x5F0F;&#x5E76;&#x4E0D;&#x662F;&#x53EA;&#x6709; React &#x4E00;&#x5BB6;, Ember 2.0 &#x5F31;&#x5316;&#x4E86; controller, &#x52A0;&#x5165; component &#x7684;&#x6982;&#x5FF5;&#xFF0C; Vue.js &#x4E5F;&#x662F;&#x7EC4;&#x4EF6;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x8F7B;&#x91CF;&#xFF0C;&#x7B80;&#x6D01;&#x4F18;&#x96C5;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9; React ? &#x539F;&#x56E0;&#x6709;&#x51E0;&#x70B9;&#xFF1A;&#x76F8;&#x6BD4; Emberjs &#x8FD9;&#x6837;&#x7684; MVC&#xFF0C;React &#x8F7B;&#x91CF;&#x3001;&#x6982;&#x5FF5;&#x5C11;&#xFF0C;&#x7B80;&#x5355;&#x6E05;&#x6670;&#xFF0C;&#x9AD8;&#x6548;&#x7684; DOM diff &#x7B97;&#x6CD5;&#x4FDD;&#x8BC1;&#x4E86;&#x6027;&#x80FD;&#xFF0C;&#x53EA;&#x505A; view &#x4E14;&#x505A;&#x7684;&#x8DB3;&#x591F;&#x597D;&#x3002;Vue &#x662F;&#x540E;&#x8D77;&#x4E4B;&#x79C0;&#xFF0C;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x66F4;&#x7B80;&#x6D01;&#xFF0C;&#x5341;&#x8DB3;&#x91CE;&#x5FC3;&#x8981;&#x66FF;&#x4EE3; React, &#x5728;&#x524D;&#x516C;&#x53F8;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x6295;&#x5165;&#x4F7F;&#x7528;&#xFF0C;&#x9047;&#x5230;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;1. &#x5728; template &#x91CC;&#x7528; computed &#x5C5E;&#x6027;&#x3001;method &#x751A;&#x81F3;&#x662F; data &#x770B;&#x8D77;&#x6765;&#x50BB;&#x50BB;&#x5206;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;component &#x91CC; data &#x8DDF; props &#x4E5F;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x534F;&#x4F5C;&#x7684;&#x8BDD;&#x9700;&#x6709;&#x56E2;&#x961F;&#x7EA6;&#x675F;&#x3002;2. &#x770B;&#x4F3C;&#x6BD4; JSX &#x7247;&#x6BB5;&#x6E05;&#x6670;&#x7684; template&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5374;&#x56E0;&#x8BED;&#x6CD5;&#x5BFC;&#x81F4;&#x5F15;&#x53F7;&#x3001;&#x62EC;&#x53F7;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7B49;&#x4F7F;&#x7528;&#x9020;&#x6210;&#x89C6;&#x89C9;&#x6DF7;&#x4E71;&#x3002;3. &#x8FD8;&#x662F;&#x6A21;&#x677F;&#x95EE;&#x9898;&#xFF0C;&#x6307;&#x4EE4;&#x5FC5;&#x987B;&#x4F9D;&#x9644; DOM&#xFF0C;&#x903B;&#x8F91;&#x597D;&#x4E0D;&#x6E05;&#x6670;(&#x636E;&#x8BF4;&#x8FD9;&#x70B9;&#x5728;2.0&#x5F97;&#x5230;&#x6539;&#x5584;)&#x3002;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x5173;&#x4E8E; template&#xFF0C;&#x4E5F;&#x4E0D;&#x7B97;&#x592A;&#x5927;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6709;&#x4EBA;&#x8BF4;&#x7ECF;&#x8FC7;&#x5F88;&#x591A;&#x5E74;&#x53D1;&#x5C55;&#xFF0C;&#x7EC8;&#x4E8E;&#x6A21;&#x677F;&#x8DDF; js &#x903B;&#x8F91;&#x5206;&#x79BB;&#x4E86;&#xFF0C;React &#x4E00;&#x4E0B;&#x5B50;&#x53C8;&#x5012;&#x9000;&#x56DE;&#x53BB;&#x4E86;&#x3002;&#x8BF4;&#x51FA;&#x8FD9;&#x8A00;&#x8BBA;&#x7684;&#x4E00;&#x5B9A;&#x6CA1;&#x7528; React&#xFF0C;&#x5F53;&#x4F60;&#x771F;&#x6B63;&#x4F53;&#x9A8C; React &#x7684;&#x300E;&#x5408;&#x5E76;&#x300F;&#x540E;&#x6216;&#x8BB8;&#x624D;&#x80FD;&#x4F53;&#x4F1A;&#x5230;&#x5B83;&#x7684;&#x65B9;&#x4FBF;&#x4E4B;&#x5904;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E5F;&#x66FE;&#x7ECF;&#x5386;&#x6A21;&#x677F;&#x903B;&#x8F91;&#x5206;&#x79BB;&#x7684;&#x4E0D;&#x540C;&#x65F6;&#x671F;&#xFF0C;&#x56DE;&#x5934;&#x60F3;&#x60F3;&#xFF0C;&#x5206;&#x79BB;&#x771F;&#x7684;&#x90A3;&#x4E48;&#x597D;&#x4E48;&#xFF1F;&#x903B;&#x8F91;&#x90E8;&#x5206;&#x8FD8;&#x597D;&#xFF0C;&#x800C;&#x6A21;&#x677F;&#x5462;&#x529F;&#x80FD;&#x592A;&#x5F31;&#xFF0C;&#x8981;&#x505A;&#x5230;&#x7CBE;&#x786E;&#x63A7;&#x5236;&#x8F93;&#x51FA;&#x5F88;&#x8D39;&#x529B;&#xFF0C;&#x800C;&#x4E14;&#x8131;&#x79BB;&#x903B;&#x8F91;&#x8C08;&#x590D;&#x7528;&#x6027;&#x4E5F;&#x5E76;&#x4E0D;&#x9760;&#x8C31;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x4E48;&#xFF1F;React &#x7684; JSX &#x7528;&#x7C7B; XML &#x7684;&#x8BED;&#x6CD5;&#x7CD6;&#xFF0C;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; JS &#x8BED;&#x6CD5;&#x6765;&#x65B9;&#x4FBF;&#x7CBE;&#x786E;&#x63A7;&#x5236;&#x8F93;&#x51FA;&#x903B;&#x8F91;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x7EC4;&#x4EF6;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x5149;&#x73AF;&#x4E5F;&#x663E;&#x5F97;&#x5341;&#x5206;&#x5408;&#x7406;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E0B;&#x5427;&#xFF0C;React &#x5E26;&#x6765;&#x4E86;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x5F00;&#x53D1;&#x4F53;&#x9A8C;&#xFF0C;&#x4E5F;&#x5F15;&#x9886;&#x4E86;&#x7EC4;&#x4EF6;&#x5F0F;&#x5F00;&#x53D1;&#x7684;&#x70ED;&#x6F6E;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x4F18;&#x52BF;&#x5F88;&#x591A;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;  </p>
<ol>
<li>learn once, write everywhere.</li>
<li>&#x6A21;&#x677F;&#x8DDF;&#x903B;&#x8F91;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x903B;&#x8F91;&#x7CBE;&#x786E;&#x65B9;&#x4FBF;&#x7684;&#x63A7;&#x5236;&#x8F93;&#x51FA;&#x3002;</li>
<li>&#x7EC4;&#x4EF6;&#x5F0F;&#x5F00;&#x53D1;&#x601D;&#x7EF4;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x8005;&#x4E13;&#x6CE8;&#x6570;&#x636E;&#x3001;&#x903B;&#x8F91;&#x3002;</li>
<li>&#x7B80;&#x6D01;&#x6E05;&#x6670;&#x7684; API&#xFF0C;&#x8F83;&#x5C11;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6613;&#x4E0A;&#x624B;&#x3002;</li>
<li>&#x5468;&#x8FB9;&#x751F;&#x6001;&#x9010;&#x6E10;&#x5B8C;&#x5584;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x505A;&#x51FA;&#x8D21;&#x732E;&#x3002;</li>
<li>&#x793E;&#x533A;&#x6D3B;&#x8DC3;&#xFF0C;&#x5E93;&#x672C;&#x8EAB;&#x5728; Facebook &#x53CA;&#x5F88;&#x591A;&#x5927;&#x5382;&#x4F7F;&#x7528;&#xFF0C;&#x80FD;&#x529B;&#x5F97;&#x5230;&#x5145;&#x5206;&#x9A8C;&#x8BC1;&#x3002;<br>&#x2026;</li>
</ol>
<p>&#x95EE;&#x9898;&#x3001;&#x7591;&#x60D1;&#x53CA;&#x5F85;&#x89E3;&#x51B3;&#xFF1A; </p>
<ol>
<li>&#x65B9;&#x6CD5;&#x666E;&#x904D;&#x592A;&#x957F;(&#x5404;&#x79CD;&#x7F16;&#x8F91;&#x5668;&#x8865;&#x5168;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x89E3;&#x51B3;)</li>
<li>&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x5F04;&#x6E05;&#x695A;&#xFF0C;&#x4E0D;&#x7136;&#x4F1A;&#x9047;&#x5230;&#x4E9B;&#x5947;&#x602A;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x7EC4;&#x4EF6;&#x5316;&#x5FC5;&#x7136;&#x5BFC;&#x81F4;&#x72B6;&#x6001;&#x7684;&#x96F6;&#x6563;&#xFF0C;&#x5982;&#x4F55;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;&#x72B6;&#x6001;&#xFF0C;&#x53C8;&#x5982;&#x4F55;&#x901A;&#x77E5;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x7EC4;&#x4EF6;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x7814;&#x7A76;&#x4E0B; flux &#x8DDF; redux&#xFF0C;&#x4F46;&#x5404;&#x6709;&#x7F3A;&#x70B9;&#x3002;</li>
<li>&#x6A21;&#x677F;&#x8DDF;&#x903B;&#x8F91;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x5199;&#x4E0D;&#x597D;&#xFF0C;&#x4E71;&#xFF0C;&#x5BF9;&#x4EBA;&#x8981;&#x6C42;&#x4E0D;&#x7B97;&#x4F4E;&#x3002;</li>
<li>&#x7EC4;&#x4EF6;&#x6837;&#x5F0F;&#x7F16;&#x5199;&#x95EE;&#x9898;&#x3002;</li>
</ol>
<p>&#x6CE8;&#x610F;: &#x672C;&#x6587;&#x4E3B;&#x89C2;&#x8272;&#x5F69;&#x8F83;&#x4E25;&#x91CD;&#xFF0C;&#x7EC6;&#x8282;&#x5E76;&#x4E0D;&#x8003;&#x7A76;&#xFF0C;&#x82E5;&#x6709;&#x95EE;&#x9898;&#x6B22;&#x8FCE;&#x6307;&#x51FA;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x60F3;&#x5230;&#x4E86;&#x518D;&#x626F;&#x5427;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/blog/categories/技术/">技术</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/blog/tags/react/">react</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>

  
	<section id="comments" class="comment">
	  <div id="disqus_thread">
	  <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
	  </div>
	</section>

	<script type="text/javascript">
	var disqus_shortname = 'wecatch';
	(function(){
	  var dsq = document.createElement('script');
	  dsq.type = 'text/javascript';
	  dsq.async = true;
	  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
	  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	}());
	(function(){
	  var dsq = document.createElement('script');
	  dsq.type = 'text/javascript';
	  dsq.async = true;
	  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
	  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	}());
	</script>





      </main>
    </article>

    <footer id="colophon" class="site-footer" role="contentinfo"><p class="site-info">
  Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
  Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
  </br>
  
  &copy; 2016 wecatch
  
</p>
</footer>
    
<script>
    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
            m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    ga('create', 'UA-79591400-1', 'auto');
    ga('send', 'pageview');

</script>

  </div>
</div>
</body>
</html>