<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>记一次 mongodb 单表亿级数据的拆分方案 | wecatch</title>
  <meta name="author" content="wecatch">
  
  <meta name="description" content="wecatch team&#39;s blog">
  
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="记一次 mongodb 单表亿级数据的拆分方案"/>
  <meta property="og:site_name" content="wecatch"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/blog/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="wecatch" type="application/atom+xml">
  <link rel="stylesheet" href="/blog/css/style.css" media="screen" type="text/css">
</head>


<body>
<div id="page" class="site">
  <div id="primary" class="content-area">

    <header id="header" class="inner"><div class="site-branding">
  <h1 class="site-title">
    <a href="/blog/">wecatch</a>
  </h1>
  <p class="site-description"></p>
</div>
<nav id="site-navigation" class="main-navigation" role="navigation">
  <ul>
    
      <li><a href="/blog">博客</a></li>
    
      <li><a href="/blog/archives">归档</a></li>
    
      <li><a href="/blog/about">关于</a></li>
    
      <li><a href="/blog/atom.xml">Rss</a></li>
    
      <li><a href="/">官网</a></li>
    
  </ul>
</nav></header>

    <article id="content" class="site-content">
      <main id="main" class="site-main posts-loop" role="main">
        <article class="post article">

  
  
    <h3 class="article-title"><span>记一次 mongodb 单表亿级数据的拆分方案</span></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/blog/2016/08/27/mongodb-single-table-split/" rel="bookmark">
        <time class="entry-date published" datetime="2016-08-27T13:38:14.000Z">
          2016-08-27
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p><a href="http://sanyuesha.com/about/" target="_blank" rel="external">&#x4E09;&#x6708;&#x6C99;</a> <a href="http://sanyuesha.com/2016/08/27/mongodb-single-table-split/" target="_blank" rel="external">&#x539F;&#x6587;&#x94FE;&#x63A5;</a></p>
<p>&#x62C6;&#x8868;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x5355;&#x8868;&#x6570;&#x636E;&#x5E93;&#x74F6;&#x9888;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E2D;&#x80FD;&#x591F;&#x90E8;&#x5206;&#x89E3;&#x51B3;&#x5355;&#x8868;&#x7684;&#x5199;&#x538B;&#x529B;&#x548C;&#x8BFB;&#x538B;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5F71;&#x54CD;&#xFF1A;</p>
<ul>
<li>&#x805A;&#x5408;&#x67E5;&#x8BE2;&#x53D8;&#x5F97;&#x56F0;&#x96BE;</li>
<li>&#x62C6;&#x5206;&#x7684;&#x952E;&#x4E00;&#x65E6;&#x9009;&#x5B9A;&#xFF0C;&#x66F4;&#x6539;&#x4F1A;&#x975E;&#x5E38;&#x56F0;&#x96BE;</li>
<li>&#x62C6;&#x8868;&#x7684;&#x8FC7;&#x7A0B;&#x8981;&#x4FDD;&#x8BC1;&#x7EBF;&#x4E0A;&#x4E1A;&#x52A1;&#x4E0D;&#x53D7;&#x5F71;&#x54CD;&#xFF0C;&#x64CD;&#x4F5C;&#x590D;&#x6742;&#x5EA6;&#x9AD8;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8868;&#x7684;&#x62C6;&#x5206;&#x4E00;&#x5B9A;&#x8981;&#x9009;&#x5728;&#x6070;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#xFF0C;&#x8FC7;&#x65E9;&#xFF0C;&#x4ED8;&#x51FA;&#x5F88;&#x5927;&#x4EE3;&#x4EF7;&#x4E5F;&#x5E76;&#x4E0D;&#x4F1A;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x8FC7;&#x665A;&#xFF0C;&#x6570;&#x636E;&#x91CF;&#x5E9E;&#x5927;&#xFF0C;&#x64CD;&#x4F5C;&#x96BE;&#x5EA6;&#x52A0;&#x5927;&#x3002;</p>
<p>&#x5728;&#x672C;&#x6B21;&#x5B9E;&#x65BD;&#x7684;&#x62C6;&#x5206;&#x65B9;&#x6848;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x7279;&#x70B9;&#x662F;:</p>
<ul>
<li>&#x5355;&#x8868;&#x8FC7;&#x4EBF;</li>
<li>&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x662F;&#x7528;&#x6237;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x6536;&#x85CF;&#xFF0C;&#x7ED3;&#x6784;&#x6BD4;&#x8F83;&#x5355;&#x4E00;</li>
<li>&#x53EA;&#x505A;&#x5355;&#x5411;(&#x7528;&#x6237;&#x2013;&gt;&#x6570;&#x636E;)&#x67E5;&#x627E;&#xFF0C;&#x4E0D;&#x8981;&#x6C42;&#x53CD;&#x5411;(&#x6570;&#x636E;&#x2013;&gt;&#x7528;&#x6237;)&#x67E5;&#x627E;</li>
<li>&#x6570;&#x636E;&#x5904;&#x4E8E;&#x5B9E;&#x65F6;&#x53D8;&#x66F4;&#x72B6;&#x6001;(&#x65B0;&#x589E;&#x3001;&#x5220;&#x9664;&#x3001;&#x67E5;&#x8BE2;&#x7B49;&#x64CD;&#x4F5C;&#x5E76;&#x5B58;)</li>
</ul>
<h2 id="&#x5982;&#x4F55;&#x9009;&#x62E9;&#x62C6;&#x5206;&#x952E;"><a href="#&#x5982;&#x4F55;&#x9009;&#x62E9;&#x62C6;&#x5206;&#x952E;" class="headerlink" title="&#x5982;&#x4F55;&#x9009;&#x62E9;&#x62C6;&#x5206;&#x952E;"></a>&#x5982;&#x4F55;&#x9009;&#x62E9;&#x62C6;&#x5206;&#x952E;</h2><p>&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x62C6;&#x5206;&#x7684;&#x952E;&#x5C31;&#x662F;&#x7528;&#x6237; id&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x5173;&#x8054;&#x7684;&#x8D44;&#x6E90;&#x6570;&#x636E;&#x6700;&#x5927;&#x4E0D;&#x4F1A;&#x8FC7;&#x4E07;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x62C6;&#x5206;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#xFF1F;"><a href="#&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x62C6;&#x5206;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#xFF1F;" class="headerlink" title="&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x62C6;&#x5206;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#xFF1F;"></a>&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x62C6;&#x5206;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#xFF1F;</h2><p>&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x57FA;&#x672C;&#x4E0A;&#x53EA;&#x6709;&#x5982;&#x4E0B;&#x64CD;&#x4F5C;</p>
<ul>
<li>&#x7528;&#x6237;&#x65B0;&#x589E;&#x4E00;&#x6761;&#x6570;&#x636E;</li>
<li>&#x7528;&#x6237;&#x5220;&#x9664;&#x4E00;&#x6761;&#x6570;&#x636E;</li>
<li>&#x7528;&#x6237;&#x67E5;&#x8BE2;&#x6570;&#x636E;(&#x6709;&#x7FFB;&#x9875;)</li>
</ul>
<a id="more"></a>
<p>&#x62C6;&#x8868;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x5C31;&#x662F;&#x5BF9;&#x9009;&#x62E9;&#x7684;&#x952E;&#x8FDB;&#x884C; hash &#x751F;&#x6210;&#x6BCF;&#x4E2A;&#x952E;&#x6240;&#x5C5E;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x540D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#xFF0C;&#x4EFB;&#x610F;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#x53EA;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#x72B6;&#x6001;</p>
<p>1.&#x5168;&#x90E8;&#x5728;&#x65E7;&#x8868;&#x4E2D;<br>2.&#x90E8;&#x5206;&#x5728;&#x65B0;&#x8868;&#xFF0C;&#x90E8;&#x5206;&#x5728;&#x65E7;&#x8868;<br>3.&#x5168;&#x90E8;&#x5728;&#x65B0;&#x8868;&#x4E2D;</p>
<p>&#x6570;&#x636E;&#x62C6;&#x5206;&#x7684;&#x5177;&#x4F53;&#x5DE5;&#x4F5C;&#x662F;&#x8981;&#x79BB;&#x7EBF;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x6570;&#x636E;&#x5728;&#x8FD9;&#x6837;&#x4E09;&#x79CD;&#x72B6;&#x6001;&#x4E4B;&#x4E0B;&#x4F9D;&#x7136;&#x5177;&#x6709;&#x50CF;&#x5355;&#x8868;&#x4E2D;&#x4E00;&#x6837;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x4E1A;&#x52A1;&#x5C42;&#x5728;&#x5904;&#x7406;&#x5F53;&#x524D;&#x7528;&#x6237;&#x6570;&#x636E;&#x65F6;&#x5224;&#x65AD;&#x7528;&#x6237;&#x662F;&#x5426;&#x5728;&#x8FC1;&#x79FB;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x5904;&#x4E8E;&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E4B;&#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x6570;&#x636E;&#x624D;&#x9700;&#x8981;&#x7279;&#x522B;&#x5904;&#x7406;&#x3002;</p>
<h3 id="&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x5982;&#x4F55;&#x5224;&#x65AD;"><a href="#&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x5982;&#x4F55;&#x5224;&#x65AD;" class="headerlink" title="&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x5982;&#x4F55;&#x5224;&#x65AD;?"></a>&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x5982;&#x4F55;&#x5224;&#x65AD;?</h3><p>&#x5982;&#x679C;&#x5F53;&#x524D;&#x7528;&#x6237;&#x6570;&#x636E;&#x5904;&#x4E8E;&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x6570;&#x636E;&#x5168;&#x90E8;&#x53EF;&#x7528;&#xFF0C;&#x5373;&#x8981;&#x505A;&#x5230;&#x4E0D;&#x8DE8;&#x8868;&#x7FFB;&#x9875;&#xFF0C;&#x8FD9;&#x91CC;&#x505A;&#x4E86;&#x7279;&#x6B8A;&#x5904;&#x7406;&#xFF1A;&#x4E00;&#x65E6;&#x5F00;&#x59CB;&#x8FC1;&#x79FB;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x5168;&#x90E8;&#x6570;&#x636E;&#x5C31;&#x4F1A;&#x8F7D;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x533A;&#x57DF;(&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7528;&#x4E86; redis&#xFF0C;&#x540E;&#x9762;&#x518D;&#x8BA8;&#x8BBA;&#x8FD9;&#x6837;&#x5904;&#x7406;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;)&#xFF0C;&#x4E14;&#x4FDD;&#x5B58;&#x4E3A;&#x6709;&#x5E8F;&#x96C6;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x5904;&#x4E8E;&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#xFF0C;&#x5219;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#x4E00;&#x5B9A;&#x5B58;&#x5728;&#x4E8E;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x6682;&#x4E14;&#x7ED9;&#x6B64;&#x533A;&#x57DF;&#x547D;&#x540D;&#x4E3A; <em>on_progress</em>&#x3002;</p>
<h3 id="&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E0B;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF1F;"><a href="#&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E0B;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF1F;" class="headerlink" title="&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E0B;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF1F;"></a>&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E0B;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF1F;</h3><p>&#x5F53;&#x7528;&#x6237;&#x5904;&#x4E8E;&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#xFF0C;&#x7528;&#x6237;&#x65B0;&#x589E;&#x4E00;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x5728;&#x65B0;&#x8868;&#x548C; <em>on_progress</em> &#x4E2D;&#x5404;&#x5199;&#x5165;&#x65B0;&#x589E;&#x6570;&#x636E;&#xFF0C;&#x7528;&#x6237;&#x5220;&#x9664;&#x4E00;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x5728;&#x65B0;&#x8868;&#x3001;<em>on_progress</em>&#x540C;&#x65F6;&#x5220;&#x9664;&#x8BE5;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x8FD9;&#x6837;&#x505A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4EC0;&#x4E48;?</strong></p>
<p>&#x5904;&#x4E8E;&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E0B;&#x7684;&#x7528;&#x6237;&#xFF0C;<em>on_progress</em> &#x4E2D;&#x4FDD;&#x5B58;&#x4E86;&#x5176;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7FFB;&#x9875;&#x64CD;&#x4F5C;&#xFF0C;<em>on_progress</em> &#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x4F1A;&#x5728;&#x79BB;&#x7EBF;&#x72B6;&#x6001;&#x4E0B;&#x4E0D;&#x65AD;&#x5199;&#x5165;&#x65B0;&#x8868;&#x4E2D;&#xFF0C;&#x8FC1;&#x79FB;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x65E7;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5C06;&#x88AB;&#x5220;&#x9664;&#xFF0C;<em>on_progress</em> &#x4E2D;&#x6570;&#x636E;&#x4E5F;&#x5C06;&#x88AB;&#x6E05;&#x9664;&#xFF0C;&#x8FD9;&#x6837;&#x7528;&#x6237;&#x6570;&#x636E;&#x5168;&#x90E8;&#x8FDB;&#x5165;&#x65B0;&#x8868;&#x4E2D;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x5C06;&#x53EA;&#x5728;&#x65B0;&#x8868;&#x4E0A;&#x8FDB;&#x884C;&#x3002;</p>
<p><em>on_progress</em> &#x4E2D;&#x7684;&#x6570;&#x636E;&#x5728;&#x4E0D;&#x65AD;&#x5199;&#x5165;&#x65B0;&#x8868;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x662F;&#x6309;&#x7167;&#x7531;&#x65B0;&#x2013;&gt;&#x65E7;&#x6216;&#x7531;&#x65E7;&#x2013;&gt;&#x65B0;&#x7684;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF1A;</p>
<blockquote>
<p>&#x7528;&#x6237;&#x5220;&#x9664;&#x4E00;&#x6761;&#x6570;&#x636E;</p>
</blockquote>
<p>1&#xFF09;&#x6709;&#x53EF;&#x80FD;&#x8BE5;&#x6761;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x5199;&#x5165;&#x65B0;&#x8868;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x8981;&#x5728;&#x65B0;&#x8868;&#x4E2D;&#x6267;&#x884C;&#x3002;<br>2&#xFF09;<em>on_progress</em> &#x4E2D;&#x7684;&#x6570;&#x636E;&#x8981;&#x59CB;&#x7EC8;&#x548C;&#x7528;&#x6237;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x540C;&#x6B65;&#x6765;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x56E0;&#x800C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x4E5F;&#x8981;&#x5728; <em>on_progress</em> &#x4E2D;&#x6267;&#x884C;&#x3002;</p>
<blockquote>
<p>&#x7528;&#x6237;&#x65B0;&#x589E;&#x4E00;&#x6761;&#x6570;&#x636E;</p>
</blockquote>
<p>1&#xFF09;<em>on_progress</em> &#x4E2D;&#x7684;&#x6570;&#x636E;&#x8981;&#x59CB;&#x7EC8;&#x548C;&#x7528;&#x6237;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x540C;&#x6B65;&#x6765;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x56E0;&#x800C; <em>on_progress</em> &#x9700;&#x8981;&#x5199;&#x5165;&#x4E00;&#x6761;&#x6570;&#x636E;&#x3002;<br>2&#xFF09;&#x5728;&#x67D0;&#x4E9B;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;<em>on_progress</em> (&#x5047;&#x5982;&#x6570;&#x636E;&#x7531;&#x65E7;&#x2013;&gt;&#x65B0;&#x5199;&#x5165;&#x65B0;&#x8868;) &#x4E2D;&#x7684;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x5B8C;&#x6210;&#x4F46;&#x8FD8;&#x672A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x7528;&#x6237;&#x6070;&#x5DE7;&#x5199;&#x5165;&#x4E00;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x6B64;&#x65F6;&#x7528;&#x6237;&#x4ECD;&#x5904;&#x4E8E;&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x79BB;&#x7EBF;&#x7684;&#x8FC1;&#x79FB;&#x64CD;&#x4F5C;&#x5DF2;&#x7ECF;&#x8BA4;&#x4E3A;&#x8FC1;&#x79FB;&#x505C;&#x6B62;&#x4E86;&#xFF0C;&#x56E0;&#x800C;&#x6B64;&#x65F6;&#x65B0;&#x589E;&#x6570;&#x636E;&#x9700;&#x8981;&#x8FDB;&#x5165;&#x65B0;&#x8868;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x6700;&#x7EC8;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<h3 id="on-progress-&#x7684;&#x9009;&#x62E9;"><a href="#on-progress-&#x7684;&#x9009;&#x62E9;" class="headerlink" title="on_progress &#x7684;&#x9009;&#x62E9;"></a>on_progress &#x7684;&#x9009;&#x62E9;</h3><p>&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x5B9E;&#x65BD;&#x4E2D;&#xFF0C;<em>on_progress</em> &#x7528;&#x4E86; redis &#x7684;&#x6709;&#x5E8F;&#x96C6;&#xFF0C;&#x952E;&#x5C31;&#x662F;&#x7528;&#x6237;&#x7684; id&#xFF0C;&#x53EA;&#x8981;&#x68C0;&#x6D4B;&#x5230;&#x7528;&#x6237; id &#x7684;&#x5B58;&#x5728;&#x5C31;&#x8BA4;&#x4E3A;&#x8BE5;&#x7528;&#x6237;&#x5904;&#x4E8E;&#x8FC1;&#x79FB;&#x72B6;&#x6001;&#x4E2D;&#x3002;</p>
<p>&#x8FC1;&#x79FB;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5148;&#x5220;&#x9664;&#x65E7;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5220;&#x9664; <em>on_progress</em> &#x4E2D;&#x6709;&#x5E8F;&#x96C6;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x53EA;&#x8981;&#x7528;&#x6237;&#x5904;&#x4E8E; redis &#x4E2D;&#xFF0C;&#x5219;&#x6B64;&#x65F6;&#x4E00;&#x5B9A;&#x662F;&#x8FC1;&#x79FB;&#x4E2D;&#x6216;&#x8FC1;&#x79FB;&#x5B8C;&#x6210;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x65E7;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x7528;&#x6237;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x8BE5;&#x7528;&#x6237;&#x4E00;&#x5B9A;&#x8FD8;&#x6CA1;&#x6709;&#x5F00;&#x59CB;&#x8FC1;&#x79FB;&#xFF0C;&#x5426;&#x5219;&#x7528;&#x6237;&#x5DF2;&#x7ECF;&#x8FC1;&#x79FB;&#x6210;&#x529F;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x9009;&#x7528; redis &#x53EF;&#x80FD;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x662F; redis &#x5B95;&#x673A;&#x4F1A;&#x5BFC;&#x81F4;&#x8FC1;&#x79FB;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x65E0;&#x6CD5;&#x56DE;&#x590D;(redis &#x672A;&#x5F00;&#x6301;&#x4E45;&#x5316;&#x64CD;&#x4F5C;&#x6216;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4E0D;&#x80FD;&#x6062;&#x590D;)&#xFF0C;&#x53EA;&#x8981;&#x7528;&#x6237;&#x5728;&#x65E7;&#x8868;&#x4E2D;&#x6709;&#x6570;&#x636E;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x7528;&#x6237;&#x5220;&#x9664;&#x6216;&#x65B0;&#x589E;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x4E00;&#x5B9A;&#x4E5F;&#x8981;&#x5728;&#x65E7;&#x8868;&#x4E2D;&#x6267;&#x884C;&#xFF0C;&#x518D;&#x6B21;&#x6062;&#x590D;&#x8FC1;&#x79FB;&#x65F6;&#xFF0C;&#x8981;&#x6E05;&#x9664;&#x65B0;&#x8868;&#x6570;&#x636E;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x6B63;&#x5E38;&#x8FDB;&#x884C;&#x3002;</p>
<p><img src="/blog/2016/08/27/mongodb-single-table-split/images/table-split.png" alt="&#x8FC1;&#x79FB;&#x6D41;&#x7A0B;&#x56FE;" width="800"></p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/blog/categories/技术/">技术</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/blog/tags/mongodb/">mongodb</a>, <a href="/blog/tags/表拆分/">表拆分</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>

  
	<section id="comments" class="comment">
	  <div id="disqus_thread">
	  <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
	  </div>
	</section>

	<script type="text/javascript">
	var disqus_shortname = 'wecatch';
	(function(){
	  var dsq = document.createElement('script');
	  dsq.type = 'text/javascript';
	  dsq.async = true;
	  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
	  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	}());
	(function(){
	  var dsq = document.createElement('script');
	  dsq.type = 'text/javascript';
	  dsq.async = true;
	  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
	  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	}());
	</script>





      </main>
    </article>

    <footer id="colophon" class="site-footer" role="contentinfo"><p class="site-info">
  Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
  Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
  </br>
  
  &copy; 2016 wecatch
  
</p>
</footer>
    
<script>
    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
            m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    ga('create', 'UA-79591400-1', 'auto');
    ga('send', 'pageview');

</script>

  </div>
</div>
</body>
</html>